virtualabs/cutcutgo/cutcutgo.X/src/packs/ATSAMG55J19_DFP/component/adc.h
#define ADC_COR_OFF_Pos                       _U_(0)                                               /**< (ADC_COR Position) Offset for Channel x */
#define ADC_COR_OFF_Msk                       (_U_(0xFF) << ADC_COR_OFF_Pos)                       /**< (ADC_COR Mask) OFF */
#define ADC_COR_OFF(value)                    (ADC_COR_OFF_Msk & ((value) << ADC_COR_OFF_Pos))     
#define ADC_COR_DIFF_Pos                      _U_(16)                                              /**< (ADC_COR Position) Differential Inputs for Channel 7 */
#define ADC_COR_DIFF_Msk                      (_U_(0xFF) << ADC_COR_DIFF_Pos)                      /**< (ADC_COR Mask) DIFF */
#define ADC_COR_DIFF(value)                   (ADC_COR_DIFF_Msk & ((value) << ADC_COR_DIFF_Pos))   

/* -------- ADC_CDR : (ADC Offset: 0x50) ( R/ 32) Channel Data Register 0 -------- */
#define ADC_CDR_DATA_Pos                      _U_(0)                                               /**< (ADC_CDR) Converted Data Position */
#define ADC_CDR_DATA_Msk                      (_U_(0xFFFF) << ADC_CDR_DATA_Pos)                    /**< (ADC_CDR) Converted Data Mask */
#define ADC_CDR_DATA(value)                   (ADC_CDR_DATA_Msk & ((value) << ADC_CDR_DATA_Pos))  
#define ADC_CDR_Msk                           _U_(0x0000FFFF)                                      /**< (ADC_CDR) Register Mask  */


/* -------- ADC_ACR : (ADC Offset: 0x94) (R/W 32) Analog Control Register -------- */
#define ADC_ACR_AUTOTEST_Pos                  _U_(30)                                              /**< (ADC_ACR) ADC Auto-test modes Position */
#define ADC_ACR_AUTOTEST_Msk                  (_U_(0x3) << ADC_ACR_AUTOTEST_Pos)                   /**< (ADC_ACR) ADC Auto-test modes Mask */
#define ADC_ACR_AUTOTEST(value)               (ADC_ACR_AUTOTEST_Msk & ((value) << ADC_ACR_AUTOTEST_Pos))
#define   ADC_ACR_AUTOTEST_NO_AUTOTEST_Val    _U_(0x0)                                             /**< (ADC_ACR) No auto test, normal mode of operation  */
#define   ADC_ACR_AUTOTEST_OFFSET_ERROR_Val   _U_(0x1)                                             /**< (ADC_ACR) Offset Error test (refer to ADC cell datasheet)  */
#define   ADC_ACR_AUTOTEST_GAIN_ERROR_HIGH_Val _U_(0x2)                                             /**< (ADC_ACR) Gain Error (high code) test (refer to ADC cell datasheet)  */
#define   ADC_ACR_AUTOTEST_GAIN_ERROR_LOW_Val _U_(0x3)                                             /**< (ADC_ACR) Gain Error (low code) test (refer to ADC cell datasheet)  */
#define ADC_ACR_AUTOTEST_NO_AUTOTEST          (ADC_ACR_AUTOTEST_NO_AUTOTEST_Val << ADC_ACR_AUTOTEST_Pos) /**< (ADC_ACR) No auto test, normal mode of operation Position  */
#define ADC_ACR_AUTOTEST_OFFSET_ERROR         (ADC_ACR_AUTOTEST_OFFSET_ERROR_Val << ADC_ACR_AUTOTEST_Pos) /**< (ADC_ACR) Offset Error test (refer to ADC cell datasheet) Position  */
#define ADC_ACR_AUTOTEST_GAIN_ERROR_HIGH      (ADC_ACR_AUTOTEST_GAIN_ERROR_HIGH_Val << ADC_ACR_AUTOTEST_Pos) /**< (ADC_ACR) Gain Error (high code) test (refer to ADC cell datasheet) Position  */
#define ADC_ACR_AUTOTEST_GAIN_ERROR_LOW       (ADC_ACR_AUTOTEST_GAIN_ERROR_LOW_Val << ADC_ACR_AUTOTEST_Pos) /**< (ADC_ACR) Gain Error (low code) test (refer to ADC cell datasheet) Position  */
#define ADC_ACR_Msk                           _U_(0xC0000000)                                      /**< (ADC_ACR) Register Mask  */


/* -------- ADC_WPMR : (ADC Offset: 0xE4) (R/W 32) Write Protection Mode Register -------- */
#define ADC_WPMR_WPEN_Pos                     _U_(0)                                               /**< (ADC_WPMR) Write Protection Enable Position */
#define ADC_WPMR_WPEN_Msk                     (_U_(0x1) << ADC_WPMR_WPEN_Pos)                      /**< (ADC_WPMR) Write Protection Enable Mask */
#define ADC_WPMR_WPEN(value)                  (ADC_WPMR_WPEN_Msk & ((value) << ADC_WPMR_WPEN_Pos))
#define ADC_WPMR_WPKEY_Pos                    _U_(8)                                               /**< (ADC_WPMR) Write Protection Key Position */
#define ADC_WPMR_WPKEY_Msk                    (_U_(0xFFFFFF) << ADC_WPMR_WPKEY_Pos)                /**< (ADC_WPMR) Write Protection Key Mask */
#define ADC_WPMR_WPKEY(value)                 (ADC_WPMR_WPKEY_Msk & ((value) << ADC_WPMR_WPKEY_Pos))
#define   ADC_WPMR_WPKEY_PASSWD_Val           _U_(0x414443)                                        /**< (ADC_WPMR) Writing any other value in this field aborts the write operation of the WPEN bit.Always reads as 0  */
#define ADC_WPMR_WPKEY_PASSWD                 (ADC_WPMR_WPKEY_PASSWD_Val << ADC_WPMR_WPKEY_Pos)    /**< (ADC_WPMR) Writing any other value in this field aborts the write operation of the WPEN bit.Always reads as 0 Position  */
#define ADC_WPMR_Msk                          _U_(0xFFFFFF01)                                      /**< (ADC_WPMR) Register Mask  */


/* -------- ADC_WPSR : (ADC Offset: 0xE8) ( R/ 32) Write Protection Status Register -------- */
#define ADC_WPSR_WPVS_Pos                     _U_(0)                                               /**< (ADC_WPSR) Write Protection Violation Status Position */
#define ADC_WPSR_WPVS_Msk                     (_U_(0x1) << ADC_WPSR_WPVS_Pos)                      /**< (ADC_WPSR) Write Protection Violation Status Mask */
#define ADC_WPSR_WPVS(value)                  (ADC_WPSR_WPVS_Msk & ((value) << ADC_WPSR_WPVS_Pos))
#define ADC_WPSR_WPVSRC_Pos                   _U_(8)                                               /**< (ADC_WPSR) Write Protection Violation Source Position */
#define ADC_WPSR_WPVSRC_Msk                   (_U_(0xFFFF) << ADC_WPSR_WPVSRC_Pos)                 /**< (ADC_WPSR) Write Protection Violation Source Mask */
#define ADC_WPSR_WPVSRC(value)                (ADC_WPSR_WPVSRC_Msk & ((value) << ADC_WPSR_WPVSRC_Pos))
#define ADC_WPSR_Msk                          _U_(0x00FFFF01)                                      /**< (ADC_WPSR) Register Mask  */


/* -------- ADC_RPR : (ADC Offset: 0x100) (R/W 32) Receive Pointer Register -------- */
#define ADC_RPR_RXPTR_Pos                     _U_(0)                                               /**< (ADC_RPR) Receive Pointer Register Position */
#define ADC_RPR_RXPTR_Msk                     (_U_(0xFFFFFFFF) << ADC_RPR_RXPTR_Pos)               /**< (ADC_RPR) Receive Pointer Register Mask */
#define ADC_RPR_RXPTR(value)                  (ADC_RPR_RXPTR_Msk & ((value) << ADC_RPR_RXPTR_Pos))
#define ADC_RPR_Msk                           _U_(0xFFFFFFFF)                                      /**< (ADC_RPR) Register Mask  */


/* -------- ADC_RCR : (ADC Offset: 0x104) (R/W 32) Receive Counter Register -------- */
#define ADC_RCR_RXCTR_Pos                     _U_(0)                                               /**< (ADC_RCR) Receive Counter Register Position */
#define ADC_RCR_RXCTR_Msk                     (_U_(0xFFFF) << ADC_RCR_RXCTR_Pos)                   /**< (ADC_RCR) Receive Counter Register Mask */
#define ADC_RCR_RXCTR(value)                  (ADC_RCR_RXCTR_Msk & ((value) << ADC_RCR_RXCTR_Pos))
#define ADC_RCR_Msk                           _U_(0x0000FFFF)                                      /**< (ADC_RCR) Register Mask  */


/* -------- ADC_RNPR : (ADC Offset: 0x110) (R/W 32) Receive Next Pointer Register -------- */
#define ADC_RNPR_RXNPTR_Pos                   _U_(0)                                               /**< (ADC_RNPR) Receive Next Pointer Position */
#define ADC_RNPR_RXNPTR_Msk                   (_U_(0xFFFFFFFF) << ADC_RNPR_RXNPTR_Pos)             /**< (ADC_RNPR) Receive Next Pointer Mask */
#define ADC_RNPR_RXNPTR(value)                (ADC_RNPR_RXNPTR_Msk & ((value) << ADC_RNPR_RXNPTR_Pos))
#define ADC_RNPR_Msk                          _U_(0xFFFFFFFF)                                      /**< (ADC_RNPR) Register Mask  */


