virtualabs/cutcutgo/cutcutgo.X/src/packs/ATSAMG55J19_DFP/component/adc.h
/* -------- ADC_RNCR : (ADC Offset: 0x114) (R/W 32) Receive Next Counter Register -------- */
#define ADC_RNCR_RXNCTR_Pos                   _U_(0)                                               /**< (ADC_RNCR) Receive Next Counter Position */
#define ADC_RNCR_RXNCTR_Msk                   (_U_(0xFFFF) << ADC_RNCR_RXNCTR_Pos)                 /**< (ADC_RNCR) Receive Next Counter Mask */
#define ADC_RNCR_RXNCTR(value)                (ADC_RNCR_RXNCTR_Msk & ((value) << ADC_RNCR_RXNCTR_Pos))
#define ADC_RNCR_Msk                          _U_(0x0000FFFF)                                      /**< (ADC_RNCR) Register Mask  */


/* -------- ADC_PTCR : (ADC Offset: 0x120) ( /W 32) Transfer Control Register -------- */
#define ADC_PTCR_RXTEN_Pos                    _U_(0)                                               /**< (ADC_PTCR) Receiver Transfer Enable Position */
#define ADC_PTCR_RXTEN_Msk                    (_U_(0x1) << ADC_PTCR_RXTEN_Pos)                     /**< (ADC_PTCR) Receiver Transfer Enable Mask */
#define ADC_PTCR_RXTEN(value)                 (ADC_PTCR_RXTEN_Msk & ((value) << ADC_PTCR_RXTEN_Pos))
#define ADC_PTCR_RXTDIS_Pos                   _U_(1)                                               /**< (ADC_PTCR) Receiver Transfer Disable Position */
#define ADC_PTCR_RXTDIS_Msk                   (_U_(0x1) << ADC_PTCR_RXTDIS_Pos)                    /**< (ADC_PTCR) Receiver Transfer Disable Mask */
#define ADC_PTCR_RXTDIS(value)                (ADC_PTCR_RXTDIS_Msk & ((value) << ADC_PTCR_RXTDIS_Pos))
#define ADC_PTCR_TXTEN_Pos                    _U_(8)                                               /**< (ADC_PTCR) Transmitter Transfer Enable Position */
#define ADC_PTCR_TXTEN_Msk                    (_U_(0x1) << ADC_PTCR_TXTEN_Pos)                     /**< (ADC_PTCR) Transmitter Transfer Enable Mask */
#define ADC_PTCR_TXTEN(value)                 (ADC_PTCR_TXTEN_Msk & ((value) << ADC_PTCR_TXTEN_Pos))
#define ADC_PTCR_TXTDIS_Pos                   _U_(9)                                               /**< (ADC_PTCR) Transmitter Transfer Disable Position */
#define ADC_PTCR_TXTDIS_Msk                   (_U_(0x1) << ADC_PTCR_TXTDIS_Pos)                    /**< (ADC_PTCR) Transmitter Transfer Disable Mask */
#define ADC_PTCR_TXTDIS(value)                (ADC_PTCR_TXTDIS_Msk & ((value) << ADC_PTCR_TXTDIS_Pos))
#define ADC_PTCR_RXCBEN_Pos                   _U_(16)                                              /**< (ADC_PTCR) Receiver Circular Buffer Enable Position */
#define ADC_PTCR_RXCBEN_Msk                   (_U_(0x1) << ADC_PTCR_RXCBEN_Pos)                    /**< (ADC_PTCR) Receiver Circular Buffer Enable Mask */
#define ADC_PTCR_RXCBEN(value)                (ADC_PTCR_RXCBEN_Msk & ((value) << ADC_PTCR_RXCBEN_Pos))
#define ADC_PTCR_RXCBDIS_Pos                  _U_(17)                                              /**< (ADC_PTCR) Receiver Circular Buffer Disable Position */
#define ADC_PTCR_RXCBDIS_Msk                  (_U_(0x1) << ADC_PTCR_RXCBDIS_Pos)                   /**< (ADC_PTCR) Receiver Circular Buffer Disable Mask */
#define ADC_PTCR_RXCBDIS(value)               (ADC_PTCR_RXCBDIS_Msk & ((value) << ADC_PTCR_RXCBDIS_Pos))
#define ADC_PTCR_TXCBEN_Pos                   _U_(18)                                              /**< (ADC_PTCR) Transmitter Circular Buffer Enable Position */
#define ADC_PTCR_TXCBEN_Msk                   (_U_(0x1) << ADC_PTCR_TXCBEN_Pos)                    /**< (ADC_PTCR) Transmitter Circular Buffer Enable Mask */
#define ADC_PTCR_TXCBEN(value)                (ADC_PTCR_TXCBEN_Msk & ((value) << ADC_PTCR_TXCBEN_Pos))
#define ADC_PTCR_TXCBDIS_Pos                  _U_(19)                                              /**< (ADC_PTCR) Transmitter Circular Buffer Disable Position */
#define ADC_PTCR_TXCBDIS_Msk                  (_U_(0x1) << ADC_PTCR_TXCBDIS_Pos)                   /**< (ADC_PTCR) Transmitter Circular Buffer Disable Mask */
#define ADC_PTCR_TXCBDIS(value)               (ADC_PTCR_TXCBDIS_Msk & ((value) << ADC_PTCR_TXCBDIS_Pos))
#define ADC_PTCR_ERRCLR_Pos                   _U_(24)                                              /**< (ADC_PTCR) Transfer Bus Error Clear Position */
#define ADC_PTCR_ERRCLR_Msk                   (_U_(0x1) << ADC_PTCR_ERRCLR_Pos)                    /**< (ADC_PTCR) Transfer Bus Error Clear Mask */
#define ADC_PTCR_ERRCLR(value)                (ADC_PTCR_ERRCLR_Msk & ((value) << ADC_PTCR_ERRCLR_Pos))
#define ADC_PTCR_Msk                          _U_(0x010F0303)                                      /**< (ADC_PTCR) Register Mask  */


/* -------- ADC_PTSR : (ADC Offset: 0x124) ( R/ 32) Transfer Status Register -------- */
#define ADC_PTSR_RXTEN_Pos                    _U_(0)                                               /**< (ADC_PTSR) Receiver Transfer Enable Position */
#define ADC_PTSR_RXTEN_Msk                    (_U_(0x1) << ADC_PTSR_RXTEN_Pos)                     /**< (ADC_PTSR) Receiver Transfer Enable Mask */
#define ADC_PTSR_RXTEN(value)                 (ADC_PTSR_RXTEN_Msk & ((value) << ADC_PTSR_RXTEN_Pos))
#define ADC_PTSR_TXTEN_Pos                    _U_(8)                                               /**< (ADC_PTSR) Transmitter Transfer Enable Position */
#define ADC_PTSR_TXTEN_Msk                    (_U_(0x1) << ADC_PTSR_TXTEN_Pos)                     /**< (ADC_PTSR) Transmitter Transfer Enable Mask */
#define ADC_PTSR_TXTEN(value)                 (ADC_PTSR_TXTEN_Msk & ((value) << ADC_PTSR_TXTEN_Pos))
#define ADC_PTSR_RXCBEN_Pos                   _U_(16)                                              /**< (ADC_PTSR) Receiver Circular Buffer Enable Position */
#define ADC_PTSR_RXCBEN_Msk                   (_U_(0x1) << ADC_PTSR_RXCBEN_Pos)                    /**< (ADC_PTSR) Receiver Circular Buffer Enable Mask */
#define ADC_PTSR_RXCBEN(value)                (ADC_PTSR_RXCBEN_Msk & ((value) << ADC_PTSR_RXCBEN_Pos))
#define ADC_PTSR_TXCBEN_Pos                   _U_(18)                                              /**< (ADC_PTSR) Transmitter Circular Buffer Enable Position */
#define ADC_PTSR_TXCBEN_Msk                   (_U_(0x1) << ADC_PTSR_TXCBEN_Pos)                    /**< (ADC_PTSR) Transmitter Circular Buffer Enable Mask */
#define ADC_PTSR_TXCBEN(value)                (ADC_PTSR_TXCBEN_Msk & ((value) << ADC_PTSR_TXCBEN_Pos))
#define ADC_PTSR_ERR_Pos                      _U_(24)                                              /**< (ADC_PTSR) Transfer Bus Error Position */
#define ADC_PTSR_ERR_Msk                      (_U_(0x1) << ADC_PTSR_ERR_Pos)                       /**< (ADC_PTSR) Transfer Bus Error Mask */
#define ADC_PTSR_ERR(value)                   (ADC_PTSR_ERR_Msk & ((value) << ADC_PTSR_ERR_Pos))  
#define ADC_PTSR_Msk                          _U_(0x01050101)                                      /**< (ADC_PTSR) Register Mask  */


/** \brief ADC register offsets definitions */
#define ADC_CR_REG_OFST                (0x00)              /**< (ADC_CR) Control Register Offset */
#define ADC_MR_REG_OFST                (0x04)              /**< (ADC_MR) Mode Register Offset */
#define ADC_SEQR1_REG_OFST             (0x08)              /**< (ADC_SEQR1) Channel Sequence Register 1 Offset */
#define ADC_CHER_REG_OFST              (0x10)              /**< (ADC_CHER) Channel Enable Register Offset */
#define ADC_CHDR_REG_OFST              (0x14)              /**< (ADC_CHDR) Channel Disable Register Offset */
#define ADC_CHSR_REG_OFST              (0x18)              /**< (ADC_CHSR) Channel Status Register Offset */
#define ADC_LCDR_REG_OFST              (0x20)              /**< (ADC_LCDR) Last Converted Data Register Offset */
#define ADC_IER_REG_OFST               (0x24)              /**< (ADC_IER) Interrupt Enable Register Offset */
#define ADC_IDR_REG_OFST               (0x28)              /**< (ADC_IDR) Interrupt Disable Register Offset */
#define ADC_IMR_REG_OFST               (0x2C)              /**< (ADC_IMR) Interrupt Mask Register Offset */
#define ADC_ISR_REG_OFST               (0x30)              /**< (ADC_ISR) Interrupt Status Register Offset */
#define ADC_LCTMR_REG_OFST             (0x34)              /**< (ADC_LCTMR) Last Channel Trigger Mode Register Offset */
#define ADC_LCCWR_REG_OFST             (0x38)              /**< (ADC_LCCWR) Last Channel Compare Window Register Offset */
#define ADC_OVER_REG_OFST              (0x3C)              /**< (ADC_OVER) Overrun Status Register Offset */
#define ADC_EMR_REG_OFST               (0x40)              /**< (ADC_EMR) Extended Mode Register Offset */
#define ADC_CWR_REG_OFST               (0x44)              /**< (ADC_CWR) Compare Window Register Offset */
#define ADC_COR_REG_OFST               (0x4C)              /**< (ADC_COR) Channel Offset Register Offset */
#define ADC_CDR_REG_OFST               (0x50)              /**< (ADC_CDR) Channel Data Register 0 Offset */
#define ADC_CDR0_REG_OFST              (0x50)              /**< (ADC_CDR0) Channel Data Register 0 Offset */
#define ADC_CDR1_REG_OFST              (0x54)              /**< (ADC_CDR1) Channel Data Register 0 Offset */
#define ADC_CDR2_REG_OFST              (0x58)              /**< (ADC_CDR2) Channel Data Register 0 Offset */
#define ADC_CDR3_REG_OFST              (0x5C)              /**< (ADC_CDR3) Channel Data Register 0 Offset */
#define ADC_CDR4_REG_OFST              (0x60)              /**< (ADC_CDR4) Channel Data Register 0 Offset */
#define ADC_CDR5_REG_OFST              (0x64)              /**< (ADC_CDR5) Channel Data Register 0 Offset */
#define ADC_CDR6_REG_OFST              (0x68)              /**< (ADC_CDR6) Channel Data Register 0 Offset */
#define ADC_CDR7_REG_OFST              (0x6C)              /**< (ADC_CDR7) Channel Data Register 0 Offset */
#define ADC_ACR_REG_OFST               (0x94)              /**< (ADC_ACR) Analog Control Register Offset */
#define ADC_WPMR_REG_OFST              (0xE4)              /**< (ADC_WPMR) Write Protection Mode Register Offset */
#define ADC_WPSR_REG_OFST              (0xE8)              /**< (ADC_WPSR) Write Protection Status Register Offset */
#define ADC_RPR_REG_OFST               (0x100)             /**< (ADC_RPR) Receive Pointer Register Offset */
#define ADC_RCR_REG_OFST               (0x104)             /**< (ADC_RCR) Receive Counter Register Offset */
#define ADC_RNPR_REG_OFST              (0x110)             /**< (ADC_RNPR) Receive Next Pointer Register Offset */
#define ADC_RNCR_REG_OFST              (0x114)             /**< (ADC_RNCR) Receive Next Counter Register Offset */
#define ADC_PTCR_REG_OFST              (0x120)             /**< (ADC_PTCR) Transfer Control Register Offset */
#define ADC_PTSR_REG_OFST              (0x124)             /**< (ADC_PTSR) Transfer Status Register Offset */

